outputs/openfoam_cases/0007/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            0.75;

seaLevelAsReference true;

relaxationNames     ( inlet );

initializationName  init;

inletCoeffs
{
    waveType            irregular;
    spectrum            JONSWAP;
    N                   200;
    Tsoft               24;
    Hs                  5.72;
    Tp                  11.93;
    gamma               3.3;
    depth               14.1;
    direction           ( 1 0 0 );
    spectramValues  nonuniform List<scalar> 
201
(
1.93581e-41
4.84696e-34
3.86867e-28
2.17445e-23
1.55132e-19
2.18786e-16
8.5416e-14
1.19537e-11
...
)
;

    fspectrum       nonuniform List<scalar> 
201
(
0.0277778
0.0290723
0.0303661
0.0316586
0.0329489
0.0342365
0.0355207
0.0368007
...
)
;

    amplitude           nonuniform List<scalar>
    200
    (
        7.92113e-19
        7.07486e-16
        1.67642e-13
        1.41494e-11
        5.30953e-10
        1.04866e-08
        1.24139e-07
        9.74398e-07
...
    );
    frequency           nonuniform List<scalar>
    200
    (
        0.0284251
        0.0297192
        0.0310123
        0.0323038
        0.0335927
        0.0348786
        0.0361607
        0.0374383
...
    );
    phaselag            nonuniform List<scalar>
    200
    (
        1.12089
        2.51125
        1.04677
        1.3328
        0.389154
        0.340234
        1.73206
        0.300068
...
    );
    waveNumber          nonuniform List<vector>
    200
    (
        (0.0153028 0 0)
        (0.016011 0 0)
        (0.0167202 0 0)
        (0.0174301 0 0)
        (0.0181404 0 0)
        (0.0188506 0 0)
        (0.0195606 0 0)
        (0.0202701 0 0)
...
    );

    frequencyAxis
    {
        discretisation      cosineStretchedFrequencyAxis;
        lowerFrequencyCutoff 0.0277778;
        upperFrequencyCutoff 0.25;
        writeSpectrum       true;
    }

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           INLET;
        startX              ( 0 0 -1 );
        endX                ( 400 0 1 );
        orientation         ( 1 0 0 );
        fieldNames          ( alpha.water U );
    }
}

initCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               24;
}



// ************************************************************************* //
